org/20211115163547-oil_price_shocks.org
:PROPERTIES:
:ID:       0e3dd495-3def-4edf-bcae-5fa568ce84fe
:END:
#+title: Oil price shocks

- tags :: [[id:d0110ef7-f82f-4568-bb0d-9ac077994b8e][Inflation]]

I suspect that oil prices are behind what we call inflation, because [[id:28820ed1-02d3-4979-84b5-684de4e565ca][you need energy to produce stuff]] and if the price of energy increases then the price of everything does increase. I think where prices meet raw materials and energy is where we understand what price really is about.

* 2008

See [[https://www.resources.org/common-resources/the-2008-oil-price-shock-markets-or-mayhem/][The 2008 Oil Price Shock: Markets or Mayhem?]]
