20211115163547-oil_price_shocks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oil price shocks</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Oil price shocks</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20210514171828-inflation.html#ID-d0110ef7-f82f-4568-bb0d-9ac077994b8e">Inflation</a></dd>
</dl>

<p>
I suspect that oil prices are behind what we call inflation, because <a href="20220117143402-you_need_energy_to_produce_stuff.html#ID-28820ed1-02d3-4979-84b5-684de4e565ca">you need energy to produce stuff</a> and if the price of energy increases then the price of everything does increase. I think where prices meet raw materials and energy is where we understand what price really is about.
</p>

<div id="outline-container-orgb3fd96e" class="outline-2">
<h2 id="orgb3fd96e">2008</h2>
<div class="outline-text-2" id="text-orgb3fd96e">
<p>
See <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.resources.org/common-resources/the-2008-oil-price-shock-markets-or-mayhem/">The 2008 Oil Price Shock: Markets or Mayhem?</a>
</p>
</div>
</div>

<div id="outline-container-orgb291d59" class="outline-2">
<h2 id="orgb291d59">Links to this note</h2>
</div>
</div>
</body>
</html>